       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULADORA.

       ENVIRONMENT DIVISION.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WKS-NUM-1       PIC S9(05)V99.
       77  WKS-NUM-2       PIC S9(05)V9(02).
       77  WKS-RESULTADO   PIC S9(10)V99.
       77  WKS-OPCION      PIC A(01).
       77  WKS-ELECCION    PIC 9(1).
       77  WKS-RES-FORMAT  PIC -ZZZZZZZZZ9.99.

       PROCEDURE DIVISION.
       00001-MI-SECCION SECTION.
       00001-MAIN.
           PERFORM 00000-CALCULADORA UNTIL WKS-ELECCION = 2.                             
                    
           STOP RUN.
           
       00000-CALCULADORA.
           DISPLAY "1-. USAR LA CALCULADORA, 2-. SALIR  ".
           ACCEPT WKS-ELECCION.
           
           IF WKS-ELECCION = 1
               PERFORM 00001-PEDIR-DATOS
               PERFORM 00002-EJECUTAR-OPERACION
           ELSE IF
                WKS-ELECCION = 2
                NEXT SENTENCE
           ELSE 
              DISPLAY "Opcion invalida,introduce la correcta".                
           
      *    RUTINA/FUNCION PEDIR DATOS. 
           
       00001-PEDIR-DATOS.   
           DISPLAY "CALCULADORA"
           DISPLAY "Introduce el NUMERO 1:".
           ACCEPT WKS-NUM-1.
           DISPLAY "Introduce el NUMERO 2:".
           ACCEPT WKS-NUM-2.
           DISPLAY "Indica la operacion a realizar: S = SUMA, " 
           "R = RESTA , M = MULTIPLICACION, D = DIVISION".
           ACCEPT WKS-OPCION.
           
      *    RUTINA/FUNCION EJECUTAR OPERACIONES.
           
       00002-EJECUTAR-OPERACION.
           IF WKS-OPCION = "S" or "s"           
               ADD WKS-NUM-1 TO WKS-NUM-2 GIVING WKS-RESULTADO
               MOVE WKS-RESULTADO TO WKS-RES-FORMAT
      *         DISPLAY "El resultado de la suma es: " WKS-RES-FORMAT
               
           ELSE IF WKS-OPCION = "R" 
               SUBTRACT WKS-NUM-1 FROM WKS-NUM-2 GIVING WKS-RESULTADO 
      *         DISPLAY "El resultado de la resta es: " WKS-RESULTADO
                   
           ELSE IF WKS-OPCION = "M"
               MULTIPLY WKS-NUM-1 BY WKS-NUM-2 GIVING WKS-RESULTADO
      *         DISPLAY "El resultado de la multipiclacion es: " 
               WKS-RESULTADO
               
           ELSE IF WKS-OPCION = "D"
               DIVIDE WKS-NUM-1 INTO WKS-NUM-2 GIVING WKS-RESULTADO
      *         DISPLAY "El resultado de la division es: " WKS-RESULTADO
               
           ELSE
               DISPLAY "Operacion indicada invalida,introduzca la corre"
               "cta". 
               
           IF WKS-OPCION = "S" OR "R" OR "M" OR "D"
               MOVE WKS-RESULTADO TO WKS-RES-FORMAT
               DISPLAY "El resultado d la operacion elegida es: " 
               WKS-RES-FORMAT.              
              
           STOP "Presiones cualquier tecla para continuar...".        
               
       END PROGRAM CALCULADORA.
